CFD_results/14.3mm-bigsplit-3out/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
87341
(
(-0.0145074227099145 0.0725963499462319 1.0440725326241)
(-0.1002775858776 0.0711850389923652 1.04485710957352)
(0.0120261700206498 0.0236702936452301 1.04932732715002)
(-0.0103230237043993 -0.00950112525903896 1.08389623136605)
(0.0127532175905407 -0.0110170477867011 1.06894730031552)
(0.0255523185313526 -0.0185991936144049 1.06414321407637)
(0.0443592704525806 0.00279453150502107 1.04704557845142)
(0.039558818740274 -0.0213270709779752 1.07547289949171)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
144
(
(7.70172310629914e-13 -3.87555636902446e-13 1.06799003655213)
(1.21730514447273e-13 2.57841779939547e-13 1.06799003655213)
(3.13129191986848e-12 3.54840896944392e-12 1.06799003655213)
(3.48600751869176e-12 3.117299307386e-12 1.06799003655213)
(-1.45472484111026e-12 1.99357137313756e-12 1.06799003655213)
(1.74582431125899e-12 1.58874808411983e-12 1.06799003655213)
(5.26733500178025e-12 8.58594442348353e-13 1.06799003655213)
(3.67411414052391e-12 2.87319281951216e-12 1.06799003655213)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
404
(
(-0.210433704737233 -0.0846395028594183 -0.438770573907734)
(-0.217767556139265 -0.0862949515050324 -0.411391063799499)
(-0.189639136610476 -0.162729640669819 -0.40945979198412)
(-0.208405304104873 -0.201127497199181 -0.439104862000814)
(-0.168835888238908 -0.145348725079011 -0.393274201589751)
(-0.153148831383484 -0.121831964055343 -0.39206456999484)
(-0.156964204956902 -0.105079390889825 -0.405376468797452)
(-0.180098055112611 -0.0960151984948178 -0.434568053219803)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
