CFD_results/14.3mm-bigsplit-3out/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
248825
(
1.51379121376986e-07
-6.9314792361634e-10
-1.8360813392445e-08
-2.49012949144035e-08
-1.34302923194838e-07
2.68789154738084e-08
-1.22068823030902e-07
-1.06010353854625e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-7.99230253311865e-08
-6.5521387080769e-08
-6.75802777017148e-08
-3.89481184838983e-08
-2.38348452600635e-07
-2.98517444879427e-07
-6.40962753874525e-08
-7.85902104547345e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
404
(
2.82945979630524e-08
3.25254305669703e-08
2.12500230190328e-08
2.17680708936329e-08
5.38574921184694e-08
8.75466828439861e-08
8.55631679883082e-08
3.15233190548234e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
