CFD_results/14.3mm-bigsplit-3out/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }
    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }
    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_3_.*" );
    }
    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_0" "patch_0_1" "patch_0_2" );
    }
);


// ************************************************************************* //
